package com.erkuai.dailyalgorithm.interview;

public class Note {

    /**
     * 介绍一下单例模式？懒汉式的单例模式如何实现单例？
     * 所谓懒汉，意思是你用到我我再创建，所以需要判空，因为不知道之前是否已经创建了。
     *
     * 请你简单讲解一下，负载均衡 反向代理模式的优点、缺点
     */


    /**
     * 贪心算法：在对问题求解时，总是做出在【当前】看来是最好的选择。
     *
     * 适用贪心算法的场景：
     * 简单地说，问题能够分解成子问题来解决，子问题的最优解能递推到最终问题的最优解。
     *
     * 贪心算法与动态规划的不同在于它对每个子问题的解决方案都做出选择，不能
     * 回退。动态规划会保存以前的运算结果，并根据以前的结果对当前进行选择，有回退功能。
     */

    /**
     * 广度优先搜索
     *
     *
     */

    /**
     * 深度优先搜索
     *
     *
     */


    /**
     * 剪枝
     *
     *  
     */
}
